{
  "slug": "pricing-and-entitlements-explained",
  "title": "Pricing & Entitlements: Tools vs Managed Delivery (Databricks)",
  "summary": "Clear, human guide to what’s included in Platform (tools) vs Enterprise (managed on Databricks), with concrete scenarios and FAQs.",
  "tags": ["pricing", "tiers", "databricks", "enterprise"],
  "bodyMd": "## Overview\n\nTwo ways to work with AethergenPlatform:\n\n- **Platform (Tools)**: you run the toolbox — generator, privacy gates, benchmarks, evidence export — under monthly quotas. Best when you have engineers and a place to run jobs.\n- **Enterprise (Managed on Databricks)**: we operate the compute and deliver datasets/models in Unity Catalog with SLAs, change control, and compliance reporting. You subscribe to outcomes, not infrastructure.\n\n## What you get\n\n### Platform (Tools)\n- Generator with privacy budgets and recipe hashing\n- Benchmarks + ablations; signed evidence export (utility, privacy, lineage)\n- API and UI access with tiered quotas\n- Optional dataset SKUs (sold separately)\n\n### Enterprise (Managed on Databricks)\n- Managed compute and orchestration on your Databricks workspace\n- Unity Catalog delivery for tables/models + evidence bundle per release\n- SLAs (availability, refresh cadence), support, audit‑ready logs\n- Change windows, rollback, and named approvals\n\n## When to choose which\n- **Platform (Tools)** if you’re engineering‑led, want to customize recipes, and are comfortable owning infra costs.\n- **Enterprise (Managed)** if you need guaranteed delivery on Databricks with governance and minimal internal lift.\n\n## Entitlements by approach\n\n| Capability | Platform (Tools) | Enterprise (Managed) |\n|---|---|---|\n| Synthetic generation | Yes (tiered quotas) | Yes (managed) |\n| Evidence bundle | Export self‑serve | Shipped with every release |\n| Datasets included | Buy per SKU | Included per contract |\n| Databricks integration | Optional | Required; UC delivery |\n| SLAs & support | Community/standard | Formal SLAs & dedicated support |\n\n## Scenarios\n\n### 1) Automotive QA team with an MLOps engineer\nYou want to tweak privacy budgets and ablations and run nightly. Start on **Platform**. Buy the automotive dataset SKU you need; generate variants under quotas; export evidence for procurement. If usage grows, move to **Enterprise** for managed cadence.\n\n### 2) Bank model risk wants fast evaluation and a paper trail\nYou want UC‑delivered tables and a signed evidence bundle without adding infra. Choose **Enterprise**. We run jobs on your Databricks, attach evidence to each release, and meet your change‑control.\n\n### 3) Startup validating a use case before scale\nUse **Platform** to prototype, keep costs predictable, and export evidence for early pilots. Upgrade to **Enterprise** once you need guaranteed refresh and support.\n\n## FAQ\n\n**Do I get datasets included with Platform?**\nPlatform focuses on the tools. Datasets are available as separate SKUs so you only buy what you need.\n\n**Can I switch later?**\nYes. We migrate recipes and evidence history; your UC objects stay the same.\n\n**What does the evidence bundle contain?**\nProvenance, privacy probes, utility metrics, ablations, and a manifest you can verify.\n\n**How is Databricks used?**\nEnterprise runs on your Databricks workspace and delivers in Unity Catalog; Platform can run anywhere you choose.\n\n—\n\n[View Pricing →](/pricing)  |  [Contact Sales →](/contact)",
  "keywords": ["pricing", "entitlements", "platform", "enterprise", "databricks"]
}


